INSERT INTO readers (reader_name, reader_adress, reader_phone) VALUES
('Сидоров', 'ул.Ленина,5а', '442-45-56'),
('Ванюшкин', 'ул.Космонавтов,д.31,кв.143', '454-52-22'),
('Дроздов', 'ул.Ленина,д.3,кв.13', '895-54-54'),
('Голубева', 'ул.Тимирязева,д.35,кв.18', '545-45-55'),
('Шишкин', 'ул.Революции,д. 16/7,кв.45', '454-56-45-64'),
('Книголюбова', 'ул.Пушкина,д.38', '546-64-545'),
('Петров', 'ул.Пушкина,д.31,кв.16', '611-56-46'),
('Паринова', NULL, '464-88-484'),
('Птичкина', 'ул.Зеленая,д.3/7', '655-45-445'),
('Дроздов', 'ул.Конструкторов,д.89,кв.14', '546-54-4');

INSERT INTO books (book_author, book_name, book_count) VALUES
('Толстой', 'Война и мир', 15),
('Достоевский', 'Идиот', 13),
('Пушкин', 'Евгений Онегин', 18),
('Пушкин', 'Руслан и Людмила', 5),
('Пушкин', 'Медный всадник', 11),
('Барто', 'Стихи детям', 1),
('Чехов', 'Вишневый сад', 8),
('Чехов', 'Дядя Ваня', 7),
('Тургенев', 'Отцы и дети', 13),
('Тургенев', 'Муму', 4);

INSERT INTO books_in_use (reader_num, book_num, issue_date, return_date) VALUES
(1, 1, '2023-09-15', '2023-10-17'),
(1, 8, '2023-10-17', NULL),
(2, 1, '2023-10-04', '2023-10-16'),
(3, 2, '2023-09-11', '2023-09-30'),
(3, 4, '2023-09-11', '2023-09-30'),
(3, 5, '2023-09-11', '2023-09-30'),
(4, 1, '2023-09-28', '2023-10-05'),
(4, 3, '2023-09-28', '2023-10-05'),
(4, 8, '2023-10-05', '2023-10-31'),
(5, 6, '2023-09-14', '2023-10-14'),
(6, 1, '2023-09-09', '2023-09-20'),
(6, 1, '2023-09-20', '2023-10-01'),
(7, 1, '2023-09-13', '2023-09-21'),
(7, 7, '2023-09-21', '2023-10-20'),
(8, 7, '2023-09-11', NULL);

UPDATE books_in_use
SET fine_amount = GREATEST(0, (DATEDIFF(return_date, issue_date) - 14) * 8.45)
WHERE return_date IS NOT NULL;
